[["Name", "Alexander Lonstein"], ["Title", "Founder at The Law Offices of Alexander Lonstein, P.C."], ["Location", "Ellenville, New York, United States"], ["About", "As the 4th generation within my family’s business of piracy identification and content protection, I have spent my entire life understanding how pirating behavior works. Piracy methods may have changed since the inception of the internet, but human nature remains the same. As a litigator and continual student of the evolution of online piracy, I have become  In pursuit of the protection of my clients' intellectual property, I have acquired experience in a variety of different types of IP. I hold Bachelor's Degrees in Political Science and History and a Juris Doctorate. I am admitted in New York State, New Jersey, the District of Columbia, and Alaska, and in the United States District Courts for the Southern and Eastern District of New York.As the 4th generation within my family’s business of piracy identification and content protection, I have spent my entire life understanding how pirating behavior works. Piracy methods may have changed since the inception of the internet, but human nature remains the same. As a litigator and continual student of the evolution of online piracy, I have become  In pursuit of the protection of my clients' intellectual property, I have acquired experience in a variety of different types of IP. I hold Bachelor's Degrees in Political Science and History and a Juris Doctorate. I am admitted in New York State, New Jersey, the District of Columbia, and Alaska, and in the United States District Courts for the Southern and Eastern District of New York."], "", ["Educations", "New York Law SchoolNew York Law School\n\n \n\nDoctor of Law (JD)Doctor of Law (JD)\n\n\n2015 - 20182015 - 2018Virginia TechVirginia Tech\n\n \n\nBachelor's degree, Political Science and GovernmentBachelor's degree, Political Science and Government\n\n\nAug 2011 - Aug 2015Aug 2011 - Aug 2015"], ["Recommendations", "General CounselGeneral Counsel\n\n \n\nVFT Solutions Inc. VFT Solutions Inc. \n\n\nJan 2019 - Present · 4 yrs 3 mosJan 2019 - Present · 4 yrs 3 mos\n\n\nGreater New York City AreaGreater New York City AreaAttorneyAttorney\n\n \n\nD.C. BarD.C. Bar\n\n\nIssued Apr 2020Issued Apr 2020AttorneyAttorney\n\n \n\nAlaska Bar AssnAlaska Bar Assn\n\n\nIssued Nov 2019Issued Nov 2019AttorneyAttorney\n\n \n\nNew York State Bar AssociationNew York State Bar Association\n\n\nIssued Apr 2019Issued Apr 2019Kirk R. MillerKirk R. Miller\n\n\n\n\n\n\n\n\n\n\n\n \n\nHuman Resources & It ConsultantHuman Resources & It Consultant\n\n\nJanuary 22, 2019, Kirk R. was Alexander’s mentorJanuary 22, 2019, Kirk R. was Alexander’s mentor\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\nTo Whom it May Concern:I am writing this letter for the purpose of attesting to the character of Alexander Lonstein. Alexander and I have known each other for almost one year. We are regular sparring partners at a local gym and I have come to know Alexander quite well and I feel equipped to comment on his character.Alexander is a recent graduate of New York Law School and often discusses his passion for the legal field. Alexander has displayed a deep knowledge of legal matters and has a strong aptitude for learning. I am also impressed by his attention to detail which is outstanding. As a hiring manager for a global financial services company, I interview and vet people from all over the world to determine, amongst many things, if they are of good character. I can attest without hesitation that Alexander is of excellent character and will contribute greatly to the success of your firm. It is for these reasons, I would recommend Alexander without reservation for a position in your firm. Best regards,Kirk MillerHuman Resources ManagerTradeview Ltd. 1123 BroadwaySuite 1103New York, NY 10010To Whom it May Concern:\n\nI am writing this letter for the purpose of attesting to the character of Alexander Lonstein. Alexander and I have known each other for almost one year. We are regular sparring partners at a local gym and I have come to know Alexander quite well and I feel equipped to comment on his character.\n\nAlexander is a recent graduate of New York Law School and often discusses his passion for the legal field. Alexander has displayed a deep knowledge of legal matters and has a strong aptitude for learning. I am also impressed by his attention to detail which is outstanding. \n\nAs a hiring manager for a global financial services company, I interview and vet people from all over the world to determine, amongst many things, if they are of good character. I can attest without hesitation that Alexander is of excellent character and will contribute greatly to the success of your firm. \n\nIt is for these reasons, I would recommend Alexander without reservation for a position in your firm. \n\nBest regards,\n\nKirk Miller\nHuman Resources Manager\nTradeview Ltd. \n1123 Broadway\nSuite 1103\nNew York, NY 10010Daymond JohnDaymond John\n\n\n\n\n\n\n\n\n\n\n\n \n\nCEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank, Public SpeakerCEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank, Public Speaker\n\n\nOctober 9, 2018, Daymond was Alexander’s mentorOctober 9, 2018, Daymond was Alexander’s mentor\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\nI have had the pleasure of knowing Alex since he was a teenager. Alex exudes an intelligence and resourcefulness that is far beyond his years. He is extremely motivated and driven and would be a valuable asset to any organization he is a part of. His work ethic is unrivaled by his peers, a valuable skill that cannot be taught, but rather developed over a lifetime of hard work. Perhaps the most impressive thing about Alex is his ability to think on his feet in the face of adversity, a skill that is uncommon among members of his generation. Alex is a young superstar in the making and I highly recommend him for any opportunity that he seeks to pursue. I have had the pleasure of knowing Alex since he was a teenager. Alex exudes an intelligence and resourcefulness that is far beyond his years. He is extremely motivated and driven and would be a valuable asset to any organization he is a part of. His work ethic is unrivaled by his peers, a valuable skill that cannot be taught, but rather developed over a lifetime of hard work. Perhaps the most impressive thing about Alex is his ability to think on his feet in the face of adversity, a skill that is uncommon among members of his generation. Alex is a young superstar in the making and I highly recommend him for any opportunity that he seeks to pursue."]]